p3p/pio-framework-arduino-lpc176x/system/CMSIS/lib/usb/usbhw.cpp
  n = USB_DMA_Status(EPNum);
  if (n != USB_DMA_DONE){
    _DBG("Start status "); _DBD32(n); _DBG("\n");
  }
  if ((LPC_USB->USBEpDMASt & (1 << num)) != 0) {
    _DBG("DMA Active "); _DBD32(pDD->BufLen); _DBG("\n");
  }
  /*
  if (pDD->BufLen > 0){
    while (((n=USB_ReadStatusEP(EPNum)) & (EP_SEL_B_1_FULL|EP_SEL_B_2_FULL)) != 0) {
      _DBG("NF "); _DBD32(n); _DBG(" "); _DBD32(pDD->BufLen);  _DBG("\n");
      if ((n & EP_SEL_ST) != 0) break;
    }
  }
  */
  for (n = 0; n < 32; n++) {                /* Search for available Memory */
    if ((DDMemMap[iso] & (1 << n)) == 0) {
      break;                                /* Memory found */
    }
  }
  if (n == 32) {
    _DBG("No descriptors available\n");
    return (FALSE);              /* Memory not available */
  }
  DDMemMap[iso] |= 1 << n;                  /* Mark Memory Usage */
  nxt = DDAdr[iso] + n * DDSz[iso];         /* Next Descriptor */
  //_DBG("DMA "); _DBD32(pDD->BufLen); _DBG("\n");
  current = UDCA[num];
  active = udca[num];                          /* Initial Descriptor */
  // move through list freeing all descriptors that have been processed
  while (active && active != current) {                             /* Go through Descriptor List */
  //while (active) {                             /* Go through Descriptor List */
    uint32_t *active_ptr = (uint32_t *)active;
    n = (active - DDAdr[iso]) / DDSz[iso];   /* Descriptor Index */
    DDMemMap[iso] &= ~(1 << n);           /* Unmark Memory Usage */
    active = *active_ptr;                  /* Next Descriptor */
  }
  last_ptr = nullptr;
  // update the current "active" pointer
  if (active != 0) {
    // now find the last active descriptor
    last_ptr = (uint32_t *)active;
    while (*last_ptr) {
        last_ptr = (uint32_t *)*last_ptr;
    }
    //if (last_ptr != (uint32_t *)active)
      //_DBG("Chain DD\n");
  }
  //_DBG("nxt "); _DBD32(UDCA[num]);
  nxt_ptr = (uint32_t *)nxt;
  /* Fill in DMA Descriptor */
  *nxt_ptr++ =  0;   /* Next DD Pointer */
  *nxt_ptr++ = (pDD->Cfg.Type.ATLE) |
               (pDD->Cfg.Type.IsoEP << 4) |
               (pDD->MaxSize <<  5) |
               (pDD->BufLen  << 16);
  *nxt_ptr++ =  pDD->BufAdr;
  *nxt_ptr++ =  pDD->Cfg.Type.LenPos << 8;
  if (iso) {
    *nxt_ptr =  pDD->InfoAdr;
  }
  //LPC_USB->USBEpDMADis = 0;
  if (last_ptr) {
    //_DBG("Chain DD \n");
    last_ptr[0]  = nxt;           /* Link in new Descriptor */
    last_ptr[1] |= 0x00000004;    /* Next DD is Valid */
    udca[num] = active;
  } else {
    //_DBG("New DD \n");
    //_DBG("DMA Enable1 "); _DBD32(LPC_USB->USBEpIntEn); _DBG(" "); _DBD32(LPC_USB->USBDMAIntSt); _DBG(" "); _DBD32(USB_DMA_Status(EPNum)); _DBG("\n");
    udca[num] = nxt;                        /* Save new Descriptor */
    UDCA[num] = nxt;                        /* Update UDCA in USB */
    //_DBG("DMA Enable2 "); _DBD32(LPC_USB->USBEpIntEn); _DBG(" "); _DBD32(LPC_USB->USBDMAIntSt); _DBG(" "); _DBD32(USB_DMA_Status(EPNum)); _DBG("\n");
  }
  //LPC_USB->USBEpDMADis = 0;
  /*
  if (pDD->BufLen > 0){
    while (((n=USB_ReadStatusEP(EPNum)) & (EP_SEL_B_1_FULL|EP_SEL_B_2_FULL)) != 0) {
      _DBG("NF2 "); _DBD32(n); _DBG(" "); _DBD32(pDD->BufLen);  _DBG("\n");
      if ((n & EP_SEL_ST) != 0) break;
    }
  }
  */
  USB_DMA_Enable(EPNum);
  return (TRUE); /* Success */
}


/*
 *  Enable USB DMA Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USB_DMA_Enable (uint32_t EPNum) {
  LPC_USB->USBEpDMAEn = 1 << EPAdr(EPNum);
}


/*
 *  Disable USB DMA Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USB_DMA_Disable (uint32_t EPNum) {
  LPC_USB->USBEpDMADis = 1 << EPAdr(EPNum);
}

void USB_DMA_Trigger (uint32_t EPNum) {
  //if ((LPC_USB->USBEpDMASt & (1 << EPAdr(EPNum))) == 0)
    LPC_USB->USBEpDMAEn = 1 << EPAdr(EPNum);
    //LPC_USB->USBDMARSet = 1 << EPAdr(EPNum);
}
/*
 *  Get USB DMA Endpoint Status
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    DMA Status
 */

uint32_t USB_DMA_Status (uint32_t EPNum) {
  uint32_t ptr, val;

  ptr = UDCA[EPAdr(EPNum)];                 /* Current Descriptor */
  if (ptr == 0) return (USB_DMA_INVALID);
//_DBD32(*((uint32_t *)(ptr + 1*4))); _DBG(" ");
  val = *((uint32_t *)(ptr + 3*4));            /* Status Information */
  switch ((val >> 1) & 0x0F) {
    case 0x00:                              /* Not serviced */
      return (USB_DMA_IDLE);
    case 0x01:                              /* Being serviced */
      return (USB_DMA_BUSY);
    case 0x02:                              /* Normal Completition */
      return (USB_DMA_DONE);
    case 0x03:                              /* Data Under Run */
      return (USB_DMA_UNDER_RUN);
    case 0x08:                              /* Data Over Run */
      return (USB_DMA_OVER_RUN);
    case 0x09:                              /* System Error */
      return (USB_DMA_ERROR);
  }

  return (USB_DMA_UNKNOWN);
}


/*
 *  Get USB DMA Endpoint Current Buffer Address
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    DMA Address (or -1 when DMA is Invalid)
 */

uint32_t USB_DMA_BufAdr (uint32_t EPNum) {
  uint32_t ptr, val;
  ptr = UDCA[EPAdr(EPNum)];                 /* Current Descriptor */
  if (ptr == 0) return ((uint32_t)(-1));    /* DMA Invalid */
  val = *((uint32_t *)(ptr + 2*4));         /* Buffer Address */
  return (val);                             /* Current Address */
}


/*
 *  Get USB DMA Endpoint Current Buffer Count
 *   Number of transfered Bytes or Iso Packets
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    DMA Count (or -1 when DMA is Invalid)
 */

